// photo_data.js (採用簡化後的新格式)

const photoData = [
  {
    "id": "img0105.jpg",
    "title": "南子吝東峰",
    "gps": "25.121710, 121.882345"  // ★ 新格式：將經緯度合併為一個字串
  },
  {
    "id": "img0110.jpg",
    "title": "南子吝東峰",
    "gps": "25.121736, 121.882354"
  },
  {
    "id": "Yungua1.jpg",
    "title": "鳶嘴山",
    "gps": "24.241389899007853, 120.95620556921459"
  },
  {
    "id": "Yungua2.jpg",
    "title": "鳶嘴山",
    "gps": "24.24139168310433, 120.95570890253113"
  },
  {
    "id": "Yungua3.jpg",
    "title": "鳶嘴山",
    "gps": "24.241134188595595, 120.95509841082298"
  },
  {
    "id": "Yungua4.jpg",
    "title": "鳶嘴山",
    "gps": "24.241116226538296, 120.95497693363868"
  },
  {
    "id": "Yungua5.jpg",
    "title": "鳶嘴山",
    "gps": "24.241195608372074, 120.95476499970269"
  },
  {
    "id": "Yungua6.jpg",
    "title": "鳶嘴山",
    "gps": "24.240957954404102, 120.95461254974941"
  },
  {
    "id": "Yungua7.jpg",
    "title": "鳶嘴山",
    "gps": "24.24067425171075, 120.95444625280481"
  },
  {
    "id": "Yungua8.jpg",
    "title": "鳶嘴山",
    "gps": "24.240135725921572, 120.95420869061095"
  },
  {
    "id": "output (10).jpg",
    "title": "國聖燈塔",
    "gps": "23.100685411743843, 120.03597167516078"
  },
  {
    "id": "output (9).jpg",
    "title": "台中公園",
    "gps": "24.143867163757193, 120.68393855461143"
  },
  {
    "id": "output.jpg",
    "title": "鳶嘴山林道",
    "gps": "24.237930443744133, 120.96233231817149"
  },
  // ... 請繼續在這裡新增您的照片資料
];



